{
    "overview_1": "Miqueas 6.8 is a non-profit organization based in Honduras dedicated to providing a home and education to orphans. Currently, they house around 40 children and must manage a large amount of food, clothing, educational material, toys, etc.",
    "overview_2": "They use a combination of Excel sheets and a mobile app made in AppSheet to manage their inventory, but as their family grows, they need an application that is more efficient and easy to use.",
    "research_1": "We were given access to the most current version of the application that they used and were able to talk with some volunteers regarding their experience using the app. From there, we created a user journey map based off of our explorations.",
    "research_2": "Ultimate Goal: Improve overall app efficiency.",
    "constraints_1": "Because we were revamping an already existing app (rather than creating something entirely new), there were some things we had to keep in mind.",
    "constraints_li_1": "No drastic design changes",
    "constraints_li_1p": "We want to reduce the learning curve for the volunteers who are used to the current app.",
    "constraints_li_2": "The system cannot be changed",
    "constraints_li_2p": "Our client expressed that they didn’t want to change how they currently organize their inventory in terms of naming, categorizing, item gendering, etc.",
    "constraints_li_3": "Spanish is required",
    "constraints_li_3p": "Many volunteers do not speak English, so Spanish translations/versions must be available.",
    "feature_1_1": "The application consists of 2 primary features:",
    "feature_1_li_1p": "How items are logged into and out of the inventory.",
    "feature_1_li_2p": "Where transactions and inventory amounts can be reviewed.",
    "feature_1_2": "The current form is dynamic as different items in the inventory have different details to specify. However, from talking with our point of contact as well as our personal usage of the application, we discovered some areas of concern in the logging process, all of which contribute to ",
    "feature_1_req_1": "Items may be of the same name and category, but if the details differ, they must all be logged separately.",
    "feature_1_req_2": "Forms do not autofill, even when there is only one possible selection option.",
    "feature_1_req_3": "Category always has to be selected first, so volunteers need to remember the the correct category of the many items.",
    "solution_1_p1_1": "In addition to improving the app’s visual design, the main goal for the transaction form was to ",
    "solution_1_p1_2": " in the logging process. Since the home is far from stores, purchases are often made in bulk and logging many nearly identical forms is tedious and can be prone to error.",
    "solution_1_p2": "The solution? Allowing the ",
    "designs_1": "With the new designs, users no longer need to rescan the QR code or reselect the item’s Category and Name when entering in multiple of the same type of item. The ability to review forms encourages volunteers to verify the accuracy of entries and reduce error.",
    "feature_2_1": "The tables are difficult to digest. Volunteers need to look back at these logs occasionally in case of discrepancies in stock and to verify that the children are being treated fairly. However, the information hierarchy is quite poor. A few improvements that can be made:",
    "feature_2_req_1": "Logs should be instantly available (you shouldn’t need to go through a location selection page first every time).",
    "feature_2_req_2": "The Inventory should be a single page.",
    "feature_2_req_3": "Quantity is an important value that should be more easy to see.",
    "solution_2_1": "The entire application’s information organization can be adjusted. The current layout is in part due to the technical limitations of AppSheet and thus includes some unused features as well as important information that is hidden. Below are the current and redesigned information architecture maps of the app.",
    "designs_2": "Because volunteers only occasionally use the tables when recounting stock and double checking discrepancies, much of the information that was previously displayed was removed to reduce cognitive load. Only the most important information (as stated by volunteers) were chosen to be displayed.",
    "reflections_p1": "This was my very first venture into product design and to say that I learned a lot would be a massive understatement. While the product was finished and handed off even despite the unexpected COVID-19 closures, I would’ve loved to be able to speak with the volunteers and learn how they’re enjoying the new application and what more ways we can improve their experience.",
    "reflections_p2": "In terms of collaboration, I got to experience working with a client and the many technical and creative challenges (and opportunities!) that come with ",
    "reflections_p3": "In previous iterations of my designs, I often got lost trying to fit as much as possible on a screen, thinking that users would want to see everything. But, from talking with volunteers to other designers, I learned the importance of really capturing what is most vital to users."
}