{
    "overview_1": "Many people struggle with planning meals and ultimately waste precious time and food as they struggle to squeeze cooking into their busy lives. recime is a recipe recommendation app catered to users’ preferences and optimized for their on-hand pantry and fridge ingredients.",
    "overview_2": "As the designer on the team, I led the development of the product’s design and brand and worked alongside other members of the team to perform research, craft a business plan, and develop our application.",
    "user_research_1": "To initially gain interest in our app idea, we conducted a very brief survey of the class (made up of college students, primarily ages 19-22). We wanted our primary users to be busy college students as we found from both personal experience and from asking peers, making actual meals in college can be difficult given time and ability constraints.",
    "market_research_1": "A recipe-recommender and virtual pantry isn't necessarily a very unique idea.",
    "market_research_2": "In fact, apps like BigOven, SuperCook, and Allrecipes Dinner Spinner have primarily the same functionalities that we planned for our application. However while researching and even briefly using these applications, we found that they were rather complex and took lots of time to get used to.",
    "user_flow_1": "Simplicity is our greatest asset. We wanted to stick to three main features: the profile, the virtual pantry, and the recipe finder. In the future, it could be beneficial to add a more social aspect to allow community contributions for more culturally inclusive dishes, but for our MVP, this is enough.",
    "branding_1": "The brand aims to be friendly and appetizing, using colors that stimulate appetite while also remaining more fun and approachable.",
    "reflections_1": "It's incredible to be able to say that we went from a singular idea to mockups to an actual application that works! Having worked on both the design and technical implementation of recime, I definitely have much more perspective on the interactions between these two roles and how they inform each other.",
    "reflections_2": "We treated recime like a startup and so I also gained very valuable experience in the more \"business\" aspects of the creation of an application. While it isn't much, this may be one of the greatest accomplishments in my short technical career. I hope there are many more to come!"
}